Repository: partout-io/passepartout
Catalog: Packages/PassepartoutWireGuardGo/Sources/PassepartoutWireGuardGo/Resources/*.lproj/Localizable.strings
Languages: fr, it, pl, pt, sv, uk

# alertInvalidInterfaceTitle
source: Invalid interface
fr: Interface invalide
it: Interfaccia non valida
pl: Nieprawidłowy interfejs
pt: Interface inválida
sv: Ogiltigt gränssnitt
uk: Некоректний інтерфейс

# alertInvalidInterfaceMessageNameRequired
source: Interface name is required
fr: Le nom de l'interface est requis
it: È richiesto il nome dell'interfaccia
pl: Nazwa interfejsu jest wymagana
pt: O nome da interface é obrigatório
sv: Gränssnittsnamn krävs
uk: Потрібно вказати назву інтерфейсу

# alertInvalidInterfaceMessagePrivateKeyRequired
source: Interface’s private key is required
fr: La clé privée de l'interface est requise
it: È richiesta la chiave privata dell'interfaccia
pl: Klucz prywatny interfejsu jest wymagany
pt: A chave privada da interface é obrigatória
sv: Gränssnittets privata nyckel krävs
uk: Потрібен приватний ключ інтерфейсу

# alertInvalidInterfaceMessagePrivateKeyInvalid
source: Interface’s private key must be a 32-byte key in base64 encoding
fr: La clé privée de l'interface doit être une clé de 32 octets en encodage base64
it: La chiave privata dell'interfaccia deve essere una chiave di 32 byte in codifica base64
pl: Klucz prywatny interfejsu musi być kluczem 32-bajtowym w kodowaniu base64
pt: A chave privada da interface deve ser uma chave de 32 bytes em codificação base64
sv: Gränssnittets privata nyckel måste vara en 32-byte nyckel i base64-kodning
uk: Приватний ключ інтерфейсу має бути 32-байтовим ключем у кодуванні base64

# alertInvalidInterfaceMessageAddressInvalid
source: Interface addresses must be a list of comma-separated IP addresses, optionally in CIDR notation
fr: Les adresses de l'interface doivent être une liste d'adresses IP séparées par des virgules, éventuellement en notation CIDR
it: Gli indirizzi dell'interfaccia devono essere un elenco di indirizzi IP separati da virgole, eventualmente in notazione CIDR
pl: Adresy interfejsu muszą być listą adresów IP oddzielonych przecinkami, opcjonalnie w notacji CIDR
pt: Os endereços da interface devem ser uma lista de endereços IP separados por vírgulas, opcionalmente em notação CIDR
sv: Gränssnittsadresser måste vara en lista med IP-adresser separerade med kommatecken, eventuellt i CIDR-notation
uk: Адреси інтерфейсу мають бути списком IP-адрес, розділених комами, за бажанням у нотації CIDR

# alertInvalidInterfaceMessageListenPortInvalid
source: Interface’s listen port must be between 0 and 65535, or unspecified
fr: Le port d'écoute de l'interface doit être compris entre 0 et 65535, ou non spécifié
it: La porta di ascolto dell'interfaccia deve essere compresa tra 0 e 65535, o non specificata
pl: Port nasłuchu interfejsu musi być w zakresie od 0 do 65535 lub nieokreślony
pt: A porta de escuta da interface deve estar entre 0 e 65535, ou não especificada
sv: Gränssnittets lyssningsport måste vara mellan 0 och 65535, eller ospecificerad
uk: Порт прослуховування інтерфейсу має бути в межах від 0 до 65535 або не вказаний

# alertInvalidInterfaceMessageMTUInvalid
source: Interface’s MTU must be between 576 and 65535, or unspecified
fr: Le MTU de l'interface doit être compris entre 576 et 65535, ou non spécifié
it: Il valore MTU dell'interfaccia deve essere compreso tra 576 e 65535, o non specificato
pl: MTU interfejsu musi być w zakresie od 576 do 65535 lub nieokreślone
pt: O MTU da interface deve estar entre 576 e 65535, ou não especificado
sv: Gränssnittets MTU måste vara mellan 576 och 65535, eller ospecificerad
uk: MTU інтерфейсу має бути в межах від 576 до 65535 або не вказаний

# alertInvalidInterfaceMessageDNSInvalid
source: Interface’s DNS servers must be a list of comma-separated IP addresses
fr: Les serveurs DNS de l'interface doivent être une liste d'adresses IP séparées par des virgules
it: I server DNS dell'interfaccia devono essere un elenco di indirizzi IP separati da virgole
pl: Serwery DNS interfejsu muszą być listą adresów IP oddzielonych przecinkami
pt: Os servidores DNS da interface devem ser uma lista de endereços IP separados por vírgulas
sv: Gränssnittets DNS-servrar måste vara en lista med IP-adresser separerade med kommatecken
uk: DNS-сервери інтерфейсу мають бути списком IP-адрес, розділених комами

# alertInvalidPeerTitle
source: Invalid peer
fr: Pair invalide
it: Peer non valido
pl: Nieprawidłowy peer
pt: Peer inválido
sv: Ogiltig peer
uk: Некоректний peer

# alertInvalidPeerMessagePublicKeyRequired
source: Peer’s public key is required
fr: La clé publique du pair est requise
it: È richiesta la chiave pubblica del peer
pl: Klucz publiczny peer’a jest wymagany
pt: A chave pública do peer é obrigatória
sv: Peers publika nyckel krävs
uk: Потрібен відкритий ключ peer’а

# alertInvalidPeerMessagePublicKeyInvalid
source: Peer’s public key must be a 32-byte key in base64 encoding
fr: La clé publique du pair doit être une clé de 32 octets en encodage base64
it: La chiave pubblica del peer deve essere una chiave di 32 byte in codifica base64
pl: Klucz publiczny peer’a musi być kluczem 32-bajtowym w kodowaniu base64
pt: A chave pública do peer deve ser uma chave de 32 bytes em codificação base64
sv: Peers publika nyckel måste vara en 32-byte nyckel i base64-kodning
uk: Відкритий ключ peer’а має бути 32-байтовим ключем у кодуванні base64

# alertInvalidPeerMessagePreSharedKeyInvalid
source: Peer’s preshared key must be a 32-byte key in base64 encoding
fr: La clé pré-partagée du pair doit être une clé de 32 octets en encodage base64
it: La chiave precondivisa del peer deve essere una chiave di 32 byte in codifica base64
pl: Klucz współdzielony peer’a musi być kluczem 32-bajtowym w kodowaniu base64
pt: A chave pré-compartilhada do peer deve ser uma chave de 32 bytes em codificação base64
sv: Peers fördelade nyckel måste vara en 32-byte nyckel i base64-kodning
uk: Попередньо розділений ключ peer’а має бути 32-байтовим ключем у кодуванні base64

# alertInvalidPeerMessageAllowedIPsInvalid
source: Peer’s allowed IPs must be a list of comma-separated IP addresses, optionally in CIDR notation
fr: Les IP autorisées du pair doivent être une liste d'adresses IP séparées par des virgules, éventuellement en notation CIDR
it: Gli IP consentiti del peer devono essere un elenco di indirizzi IP separati da virgole, eventualmente in notazione CIDR
pl: Dozwolone IP peer’a muszą być listą adresów IP oddzielonych przecinkami, opcjonalnie w notacji CIDR
pt: Os IPs permitidos do peer devem ser uma lista de endereços IP separados por vírgulas, opcionalmente em notação CIDR
sv: Peers tillåtna IP-adresser måste vara en lista med IP-adresser separerade med kommatecken, eventuellt i CIDR-notation
uk: Дозволені IP-адреси peer’а мають бути списком IP-адрес, розділених комами, за бажанням у нотації CIDR

# alertInvalidPeerMessageEndpointInvalid
source: Peer’s endpoint must be of the form ‘host:port’ or ‘[host]:port’
fr: Le point de terminaison du pair doit être au format 'host:port' ou '[host]:port'
it: L'endpoint del peer deve essere nel formato 'host:port' o '[host]:port'
pl: Endpoint peer’a musi mieć format 'host:port' lub '[host]:port'
pt: O endpoint do peer deve estar no formato 'host:port' ou '[host]:port'
sv: Peers slutpunkt måste ha formatet 'host:port' eller '[host]:port'
uk: Адреса peer’а має бути у форматі 'host:port' або '[host]:port'

# alertInvalidPeerMessagePersistentKeepaliveInvalid
source: Peer’s persistent keepalive must be between 0 to 65535, or unspecified
fr: La valeur du keepalive persistant du pair doit être comprise entre 0 et 65535, ou non spécifiée
it: Il valore di keepalive persistente del peer deve essere compreso tra 0 e 65535, o non specificato
pl: Wartość persistent keepalive peer’a musi być w zakresie od 0 do 65535 lub nieokreślona
pt: O valor de keepalive persistente do peer deve estar entre 0 e 65535, ou não especificado
sv: Peers persistent keepalive-värde måste vara mellan 0 och 65535, eller ospecificerat
uk: Значення постійного keepalive peer’а має бути в межах від 0 до 65535 або не вказане

# alertInvalidPeerMessagePublicKeyDuplicated
source: Two or more peers cannot have the same public key
fr: Deux pairs ou plus ne peuvent pas avoir la même clé publique
it: Due o più peer non possono avere la stessa chiave pubblica
pl: Dwa lub więcej peer’ów nie może mieć tego samego klucza publicznego
pt: Dois ou mais peers não podem ter a mesma chave pública
sv: Två eller fler peers kan inte ha samma publika nyckel
uk: Два або більше peer’ів не можуть мати один і той самий відкритий ключ

# macAlertInvalidLine (%@)
source: Invalid line: ‘%@’.
fr: Ligne invalide : '%@'.
it: Riga non valida: '%@'.
pl: Nieprawidłowa linia: '%@'.
pt: Linha inválida: '%@'.
sv: Ogiltig rad: '%@'.
uk: Некоректний рядок: '%@'.

# macAlertNoInterface
source: Configuration must have an ‘Interface’ section.
fr: La configuration doit comporter une section 'Interface'.
it: La configurazione deve contenere una sezione 'Interface'.
pl: Konfiguracja musi zawierać sekcję 'Interface'.
pt: A configuração deve ter uma seção 'Interface'.
sv: Konfigurationen måste ha en 'Interface'-sektion.
uk: Конфігурація має містити розділ 'Interface'.

# macAlertMultipleInterfaces
source: Configuration must have only one ‘Interface’ section.
fr: La configuration ne doit comporter qu'une seule section 'Interface'.
it: La configurazione deve contenere solo una sezione 'Interface'.
pl: Konfiguracja może zawierać tylko jedną sekcję 'Interface'.
pt: A configuração deve ter apenas uma seção 'Interface'.
sv: Konfigurationen får endast ha en 'Interface'-sektion.
uk: Конфігурація має містити лише один розділ 'Interface'.

# macAlertPrivateKeyInvalid
source: Private key is invalid.
fr: La clé privée est invalide.
it: La chiave privata non è valida.
pl: Klucz prywatny jest nieprawidłowy.
pt: A chave privada é inválida.
sv: Privat nyckel är ogiltig.
uk: Приватний ключ некоректний.

# macAlertListenPortInvalid (%@)
source: Listen port ‘%@’ is invalid.
fr: Le port d'écoute '%@' est invalide.
it: La porta di ascolto '%@' non è valida.
pl: Port nasłuchu '%@' jest nieprawidłowy.
pt: A porta de escuta '%@' é inválida.
sv: Lyssningsport '%@' är ogiltig.
uk: Порт прослуховування '%@' некоректний.

# macAlertAddressInvalid (%@)
source: Address ‘%@’ is invalid.
fr: L'adresse '%@' est invalide.
it: L'indirizzo '%@' non è valido.
pl: Adres '%@' jest nieprawidłowy.
pt: O endereço '%@' é inválido.
sv: Adress '%@' är ogiltig.
uk: Адреса '%@' некоректна.

# macAlertDNSInvalid (%@)
source: DNS ‘%@’ is invalid.
fr: Le DNS '%@' est invalide.
it: Il DNS '%@' non è valido.
pl: DNS '%@' jest nieprawidłowy.
pt: O DNS '%@' é inválido.
sv: DNS '%@' är ogiltig.
uk: DNS '%@' некоректний.

# macAlertMTUInvalid (%@)
source: MTU ‘%@’ is invalid.
fr: Le MTU '%@' est invalide.
it: Il valore MTU '%@' non è valido.
pl: MTU '%@' jest nieprawidłowe.
pt: O MTU '%@' é inválido.
sv: MTU '%@' är ogiltig.
uk: MTU '%@' некоректний.

# macAlertUnrecognizedInterfaceKey (%@)
source: Interface contains unrecognized key ‘%@’
fr: L'interface contient une clé non reconnue '%@'
it: L'interfaccia contiene una chiave non riconosciuta '%@'
pl: Interfejs zawiera nierozpoznany klucz '%@'
pt: A interface contém uma chave não reconhecida '%@'
sv: Gränssnittet innehåller en okänd nyckel '%@'
uk: Інтерфейс містить нерозпізнаний ключ '%@'

# macAlertInfoUnrecognizedInterfaceKey
source: Valid keys are: ‘PrivateKey’, ‘ListenPort’, ‘Address’, ‘DNS’ and ‘MTU’.
fr: Les clés valides sont : 'PrivateKey', 'ListenPort', 'Address', 'DNS' et 'MTU'.
it: Le chiavi valide sono: 'PrivateKey', 'ListenPort', 'Address', 'DNS' e 'MTU'.
pl: Prawidłowe klucze to: 'PrivateKey', 'ListenPort', 'Address', 'DNS' i 'MTU'.
pt: As chaves válidas são: 'PrivateKey', 'ListenPort', 'Address', 'DNS' e 'MTU'.
sv: Giltiga nycklar är: 'PrivateKey', 'ListenPort', 'Address', 'DNS' och 'MTU'.
uk: Дійсні ключі: 'PrivateKey', 'ListenPort', 'Address', 'DNS' і 'MTU'.

# macAlertPublicKeyInvalid
source: Public key is invalid
fr: La clé publique est invalide
it: La chiave pubblica non è valida
pl: Klucz publiczny jest nieprawidłowy
pt: A chave pública é inválida
sv: Publik nyckel är ogiltig
uk: Відкритий ключ некоректний

# macAlertPreSharedKeyInvalid
source: Preshared key is invalid
fr: La clé pré-partagée est invalide
it: La chiave precondivisa non è valida
pl: Klucz współdzielony jest nieprawidłowy
pt: A chave pré-compartilhada é inválida
sv: Fördelad nyckel är ogiltig
uk: Попередньо розділений ключ некоректний

# macAlertAllowedIPInvalid (%@)
source: Allowed IP ‘%@’ is invalid
fr: L'IP autorisée '%@' est invalide
it: L'IP consentito '%@' non è valido
pl: Dozwolone IP '%@' jest nieprawidłowe
pt: O IP permitido '%@' é inválido
sv: Tillåten IP '%@' är ogiltig
uk: Дозволена IP-адреса '%@' некоректна

# macAlertEndpointInvalid (%@)
source: Endpoint ‘%@’ is invalid
fr: Le point de terminaison '%@' est invalide
it: L'endpoint '%@' non è valido
pl: Endpoint '%@' jest nieprawidłowy
pt: O endpoint '%@' é inválido
sv: Slutpunkt '%@' är ogiltig
uk: Адреса '%@' некоректна

# macAlertPersistentKeepliveInvalid (%@)
source: Persistent keepalive value ‘%@’ is invalid
fr: La valeur du keepalive persistant '%@' est invalide
it: Il valore di keepalive persistente '%@' non è valido
pl: Wartość persistent keepalive '%@' jest nieprawidłowa
pt: O valor de keepalive persistente '%@' é inválido
sv: Persistent keepalive-värde '%@' är ogiltigt
uk: Значення постійного keepalive '%@' некоректне

# macAlertUnrecognizedPeerKey (%@)
source: Peer contains unrecognized key ‘%@’
fr: Le pair contient une clé non reconnue '%@'
it: Il peer contiene una chiave non riconosciuta '%@'
pl: Peer zawiera nierozpoznany klucz '%@'
pt: O peer contém uma chave não reconhecida '%@'
sv: Peer innehåller en okänd nyckel '%@'
uk: Peer містить нерозпізнаний ключ '%@'

# macAlertInfoUnrecognizedPeerKey
source: Valid keys are: ‘PublicKey’, ‘PresharedKey’, ‘AllowedIPs’, ‘Endpoint’ and ‘PersistentKeepalive’
fr: Les clés valides sont : 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' et 'PersistentKeepalive'
it: Le chiavi valide sono: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' e 'PersistentKeepalive'
pl: Prawidłowe klucze to: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' i 'PersistentKeepalive'
pt: As chaves válidas são: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' e 'PersistentKeepalive'
sv: Giltiga nycklar är: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' och 'PersistentKeepalive'
uk: Дійсні ключі: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' і 'PersistentKeepalive'

# macAlertMultipleEntriesForKey (%@)
source: There should be only one entry per section for key ‘%@’
fr: Il ne doit y avoir qu'une seule entrée par section pour la clé '%@'
it: Deve esserci solo una voce per sezione per la chiave '%@'
pl: Powinna być tylko jedna wartość na sekcję dla klucza '%@'
pt: Deve haver apenas uma entrada por seção para a chave '%@'
sv: Det bör endast finnas en post per sektion för nyckeln '%@'
uk: У кожному розділі має бути лише один запис для ключа '%@'
