Repository: partout-io/passepartout
Catalog: Packages/PartoutWireGuardGo/Sources/PassepartoutWireGuardGo/Resources/*.lproj/Localizable.strings
Languages: el, nl, ru, zh_hans

source: alertInvalidInterfaceTitle
el: Μη έγκυρη διεπαφή
nl: Ongeldige interface
ru: Недопустимый интерфейс
zh_hans: 无效的接口

source: alertInvalidInterfaceMessageNameRequired
el: Απαιτείται όνομα διεπαφής
nl: Interfacenaam is vereist
ru: Требуется имя интерфейса
zh_hans: 接口名称是必需的

source: alertInvalidInterfaceMessagePrivateKeyRequired
el: Απαιτείται ιδιωτικό κλειδί διεπαφής
nl: Privésleutel van de interface is vereist
ru: Требуется закрытый ключ интерфейса
zh_hans: 接口的私钥是必需的

source: alertInvalidInterfaceMessagePrivateKeyInvalid
el: Το ιδιωτικό κλειδί της διεπαφής πρέπει να είναι ένα κλειδί 32-byte σε κωδικοποίηση base64
nl: De privésleutel van de interface moet een 32-byte sleutel zijn in base64-codering
ru: Закрытый ключ интерфейса должен быть 32-байтовым ключом в кодировке base64
zh_hans: 接口的私钥必须是一个 32 字节的 Base64 编码密钥

source: alertInvalidInterfaceMessageAddressInvalid
el: Οι διευθύνσεις της διεπαφής πρέπει να είναι μια λίστα από IP διευθύνσεις χωρισμένες με κόμμα, προαιρετικά σε σημειογραφία CIDR
nl: Interface-adressen moeten een lijst zijn van door komma's gescheiden IP-adressen, optioneel in CIDR-notatie
ru: Адреса интерфейса должны представлять собой список IP-адресов, разделенных запятыми, возможно в нотации CIDR
zh_hans: 接口地址必须是以逗号分隔的 IP 地址列表，可选使用 CIDR 表示法

source: alertInvalidInterfaceMessageListenPortInvalid
el: Η θύρα ακρόασης της διεπαφής πρέπει να είναι μεταξύ 0 και 65535, ή να μην έχει καθοριστεί
nl: De luisterpoort van de interface moet tussen 0 en 65535 liggen, of niet gespecificeerd
ru: Порт прослушивания интерфейса должен быть от 0 до 65535 или не указан
zh_hans: 接口的监听端口必须在 0 到 65535 之间，或未指定

source: alertInvalidInterfaceMessageMTUInvalid
el: Το MTU της διεπαφής πρέπει να είναι μεταξύ 576 και 65535, ή να μην έχει καθοριστεί
nl: De MTU van de interface moet tussen 576 en 65535 liggen, of niet gespecificeerd
ru: MTU интерфейса должен быть от 576 до 65535 или не указан
zh_hans: 接口的 MTU 必须在 576 到 65535 之间，或未指定

source: alertInvalidInterfaceMessageDNSInvalid
el: Οι διακομιστές DNS της διεπαφής πρέπει να είναι μια λίστα από IP διευθύνσεις χωρισμένες με κόμμα
nl: De DNS-servers van de interface moeten een lijst zijn van door komma's gescheiden IP-adressen
ru: Серверы DNS интерфейса должны представлять собой список IP-адресов, разделенных запятыми
zh_hans: 接口的 DNS 服务器必须是以逗号分隔的 IP 地址列表

source: alertInvalidPeerTitle
el: Μη έγκυρος peer
nl: Ongeldige peer
ru: Недопустимый peer
zh_hans: 无效的 Peer

source: alertInvalidPeerMessagePublicKeyRequired
el: Απαιτείται δημόσιο κλειδί του peer
nl: De openbare sleutel van de peer is vereist
ru: Требуется открытый ключ peer’а
zh_hans: Peer 的公钥是必需的

source: alertInvalidPeerMessagePublicKeyInvalid
el: Το δημόσιο κλειδί του peer πρέπει να είναι ένα κλειδί 32-byte σε κωδικοποίηση base64
nl: De openbare sleutel van de peer moet een 32-byte sleutel zijn in base64-codering
ru: Открытый ключ peer’а должен быть 32-байтовым ключом в кодировке base64
zh_hans: Peer 的公钥必须是一个 32 字节的 Base64 编码密钥

source: alertInvalidPeerMessagePreSharedKeyInvalid
el: Το προ-μοιρασμένο κλειδί του peer πρέπει να είναι ένα κλειδί 32-byte σε κωδικοποίηση base64
nl: De vooraf gedeelde sleutel van de peer moet een 32-byte sleutel zijn in base64-codering
ru: Предварительно разделяемый ключ peer’а должен быть 32-байтовым ключом в кодировке base64
zh_hans: Peer 的预共享密钥必须是一个 32 字节的 Base64 编码密钥

source: alertInvalidPeerMessageAllowedIPsInvalid
el: Οι επιτρεπόμενες IP του peer πρέπει να είναι μια λίστα από IP διευθύνσεις χωρισμένες με κόμμα, προαιρετικά σε σημειογραφία CIDR
nl: De toegestane IP's van de peer moeten een lijst zijn van door komma's gescheiden IP-adressen, optioneel in CIDR-notatie
ru: Разрешенные IP-адреса peer’а должны представлять собой список IP-адресов, разделенных запятыми, возможно в нотации CIDR
zh_hans: Peer 的允许 IP 必须是以逗号分隔的 IP 地址列表，可选使用 CIDR 表示法

source: alertInvalidPeerMessageEndpointInvalid
el: Το endpoint του peer πρέπει να είναι της μορφής 'host:port' ή '[host]:port'
nl: De endpoint van de peer moet de vorm 'host:port' of '[host]:port' hebben
ru: Адрес peer’а должен быть в формате 'host:port' или '[host]:port'
zh_hans: Peer 的端点必须是 'host:port' 或 '[host]:port' 格式

source: alertInvalidPeerMessagePersistentKeepaliveInvalid
el: Η τιμή του persistent keepalive του peer πρέπει να είναι μεταξύ 0 και 65535, ή να μην έχει καθοριστεί
nl: De persistent keepalive van de peer moet tussen 0 en 65535 liggen, of niet gespecificeerd
ru: Значение постоянного keepalive peer’а должно быть от 0 до 65535 или не указано
zh_hans: Peer 的持久 Keepalive 值必须在 0 到 65535 之间，或未指定

source: alertInvalidPeerMessagePublicKeyDuplicated
el: Δύο ή περισσότεροι peers δεν μπορούν να έχουν το ίδιο δημόσιο κλειδί
nl: Twee of meer peers kunnen niet dezelfde openbare sleutel hebben
ru: Два или более peer’ов не могут иметь один и тот же открытый ключ
zh_hans: 两个或更多的 Peer 不能使用相同的公钥

source: macAlertInvalidLine (%@)
el: Μη έγκυρη γραμμή: '%@'.
nl: Ongeldige regel: '%@'.
ru: Недопустимая строка: '%@'.
zh_hans: 无效的行: '%@'。

source: macAlertNoInterface
el: Η διαμόρφωση πρέπει να έχει ένα τμήμα 'Interface'.
nl: De configuratie moet een 'Interface'-sectie bevatten.
ru: Конфигурация должна содержать раздел 'Interface'.
zh_hans: 配置必须包含一个 'Interface' 部分。

source: macAlertMultipleInterfaces
el: Η διαμόρφωση πρέπει να έχει μόνο ένα τμήμα 'Interface'.
nl: De configuratie mag slechts één 'Interface'-sectie bevatten.
ru: Конфигурация должна содержать только один раздел 'Interface'.
zh_hans: 配置必须只有一个 'Interface' 部分。

source: macAlertPrivateKeyInvalid
el: Το ιδιωτικό κλειδί δεν είναι έγκυρο.
nl: De privésleutel is ongeldig.
ru: Закрытый ключ недопустим.
zh_hans: 私钥无效。

source: macAlertListenPortInvalid (%@)
el: Η θύρα ακρόασης '%@' δεν είναι έγκυρη.
nl: De luisterpoort '%@' is ongeldig.
ru: Порт прослушивания '%@' недопустим.
zh_hans: 监听端口 '%@' 无效。

source: macAlertAddressInvalid (%@)
el: Η διεύθυνση '%@' δεν είναι έγκυρη.
nl: Het adres '%@' is ongeldig.
ru: Адрес '%@' недопустим.
zh_hans: 地址 '%@' 无效。

source: macAlertDNSInvalid (%@)
el: Το DNS '%@' δεν είναι έγκυρο.
nl: De DNS '%@' is ongeldig.
ru: DNS '%@' недопустим.
zh_hans: DNS '%@' 无效。

source: macAlertMTUInvalid (%@)
el: Το MTU '%@' δεν είναι έγκυρο.
nl: De MTU '%@' is ongeldig.
ru: MTU '%@' недопустим.
zh_hans: MTU '%@' 无效。

source: macAlertUnrecognizedInterfaceKey (%@)
el: Η διεπαφή περιέχει μη αναγνωρισμένο κλειδί '%@'
nl: De interface bevat een niet-herkende sleutel '%@'
ru: Интерфейс содержит нераспознанный ключ '%@'
zh_hans: 接口包含未识别的键 '%@'

source: macAlertInfoUnrecognizedInterfaceKey
el: Τα έγκυρα κλειδιά είναι: 'PrivateKey', 'ListenPort', 'Address', 'DNS' και 'MTU'.
nl: Geldige sleutels zijn: 'PrivateKey', 'ListenPort', 'Address', 'DNS' en 'MTU'.
ru: Допустимые ключи: 'PrivateKey', 'ListenPort', 'Address', 'DNS' и 'MTU'.
zh_hans: 有效的键包括: 'PrivateKey'、'ListenPort'、'Address'、'DNS' 和 'MTU'。

source: macAlertPublicKeyInvalid
el: Το δημόσιο κλειδί δεν είναι έγκυρο
nl: De openbare sleutel is ongeldig
ru: Открытый ключ недопустим
zh_hans: 公钥无效

source: macAlertPreSharedKeyInvalid
el: Το προ-μοιρασμένο κλειδί δεν είναι έγκυρο
nl: De vooraf gedeelde sleutel is ongeldig
ru: Предварительно разделяемый ключ недопустим
zh_hans: 预共享密钥无效

source: macAlertAllowedIPInvalid (%@)
el: Η επιτρεπόμενη IP '%@' δεν είναι έγκυρη
nl: De toegestane IP '%@' is ongeldig
ru: Разрешенный IP '%@' недопустим
zh_hans: 允许的 IP '%@' 无效

source: macAlertEndpointInvalid (%@)
el: Το endpoint '%@' δεν είναι έγκυρο
nl: De endpoint '%@' is ongeldig
ru: Адрес '%@' недопустим
zh_hans: 端点 '%@' 无效

source: macAlertPersistentKeepliveInvalid (%@)
el: Η τιμή του persistent keepalive '%@' δεν είναι έγκυρη
nl: De persistent keepalive waarde '%@' is ongeldig
ru: Значение постоянного keepalive '%@' недопустимо
zh_hans: 持久 Keepalive 值 '%@' 无效

source: macAlertUnrecognizedPeerKey (%@)
el: Ο peer περιέχει μη αναγνωρισμένο κλειδί '%@'
nl: De peer bevat een niet-herkende sleutel '%@'
ru: Peer содержит нераспознанный ключ '%@'
zh_hans: Peer 包含未识别的键 '%@'

source: macAlertInfoUnrecognizedPeerKey
el: Τα έγκυρα κλειδιά είναι: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' και 'PersistentKeepalive'
nl: Geldige sleutels zijn: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' en 'PersistentKeepalive'
ru: Допустимые ключи: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' и 'PersistentKeepalive'
zh_hans: 有效的键包括: 'PublicKey'、'PresharedKey'、'AllowedIPs'、'Endpoint' 和 'PersistentKeepalive'。

source: macAlertMultipleEntriesForKey (%@)
el: Πρέπει να υπάρχει μόνο μία καταχώρηση ανά τμήμα για το κλειδί '%@'
nl: Er mag slechts één invoer per sectie zijn voor sleutel '%@'
ru: Должна быть только одна запись на раздел для ключа '%@'
zh_hans: 每个部分只能包含一个 '%@' 键的条目
