Repository: partout-io/passepartout
Catalog: Packages/PartoutWireGuardGo/Sources/PartoutWireGuardGo/Resources/*.lproj/Localizable.strings
Languages: de, es

source: alertInvalidInterfaceTitle
de: Ungültige Schnittstelle
es: Interfaz no válida

source: alertInvalidInterfaceMessageNameRequired
de: Schnittstellenname ist erforderlich
es: Se requiere el nombre de la interfaz

source: alertInvalidInterfaceMessagePrivateKeyRequired
de: Privater Schlüssel der Schnittstelle ist erforderlich
es: Se requiere la clave privada de la interfaz

source: alertInvalidInterfaceMessagePrivateKeyInvalid
de: Privater Schlüssel der Schnittstelle muss ein 32-Byte-Schlüssel in Base64-Codierung sein
es: La clave privada de la interfaz debe ser una clave de 32 bytes en codificación base64

source: alertInvalidInterfaceMessageAddressInvalid
de: Schnittstellenadressen müssen eine Liste von durch Kommas getrennten IP-Adressen sein, optional in CIDR-Notation
es: Las direcciones de la interfaz deben ser una lista de direcciones IP separadas por comas, opcionalmente en notación CIDR

source: alertInvalidInterfaceMessageListenPortInvalid
de: Der Listen-Port der Schnittstelle muss zwischen 0 und 65535 liegen oder nicht angegeben sein
es: El puerto de escucha de la interfaz debe estar entre 0 y 65535, o no especificado

source: alertInvalidInterfaceMessageMTUInvalid
de: Die MTU der Schnittstelle muss zwischen 576 und 65535 liegen oder nicht angegeben sein
es: El MTU de la interfaz debe estar entre 576 y 65535, o no especificado

source: alertInvalidInterfaceMessageDNSInvalid
de: Die DNS-Server der Schnittstelle müssen eine Liste von durch Kommas getrennten IP-Adressen sein
es: Los servidores DNS de la interfaz deben ser una lista de direcciones IP separadas por comas

source: alertInvalidPeerTitle
de: Ungültiger Peer
es: Peer no válido

source: alertInvalidPeerMessagePublicKeyRequired
de: Öffentlicher Schlüssel des Peers ist erforderlich
es: Se requiere la clave pública del peer

source: alertInvalidPeerMessagePublicKeyInvalid
de: Öffentlicher Schlüssel des Peers muss ein 32-Byte-Schlüssel in Base64-Codierung sein
es: La clave pública del peer debe ser una clave de 32 bytes en codificación base64

source: alertInvalidPeerMessagePreSharedKeyInvalid
de: Vorgeschalteter Schlüssel des Peers muss ein 32-Byte-Schlüssel in Base64-Codierung sein
es: La clave precompartida del peer debe ser una clave de 32 bytes en codificación base64

source: alertInvalidPeerMessageAllowedIPsInvalid
de: Die erlaubten IPs des Peers müssen eine Liste von durch Kommas getrennten IP-Adressen sein, optional in CIDR-Notation
es: Las IP permitidas del peer deben ser una lista de direcciones IP separadas por comas, opcionalmente en notación CIDR

source: alertInvalidPeerMessageEndpointInvalid
de: Das Endpunkt des Peers muss die Form 'host:port' oder '[host]:port' haben
es: El punto de conexión del peer debe tener el formato 'host:port' o '[host]:port'

source: alertInvalidPeerMessagePersistentKeepaliveInvalid
de: Der Wert für das persistente Keepalive des Peers muss zwischen 0 und 65535 liegen oder nicht angegeben sein
es: El valor de keepalive persistente del peer debe estar entre 0 y 65535, o no especificado

source: alertInvalidPeerMessagePublicKeyDuplicated
de: Zwei oder mehr Peers dürfen nicht denselben öffentlichen Schlüssel haben
es: Dos o más peers no pueden tener la misma clave pública

source: macAlertInvalidLine (%@)
de: Ungültige Zeile: '%@'.
es: Línea no válida: '%@'.

source: macAlertNoInterface
de: Die Konfiguration muss einen 'Interface'-Abschnitt haben.
es: La configuración debe tener una sección 'Interface'.

source: macAlertMultipleInterfaces
de: Die Konfiguration darf nur einen 'Interface'-Abschnitt haben.
es: La configuración debe tener solo una sección 'Interface'.

source: macAlertPrivateKeyInvalid
de: Privater Schlüssel ist ungültig.
es: La clave privada no es válida.

source: macAlertListenPortInvalid (%@)
de: Listen-Port '%@' ist ungültig.
es: El puerto de escucha '%@' no es válido.

source: macAlertAddressInvalid (%@)
de: Adresse '%@' ist ungültig.
es: La dirección '%@' no es válida.

source: macAlertDNSInvalid (%@)
de: DNS '%@' ist ungültig.
es: El DNS '%@' no es válido.

source: macAlertMTUInvalid (%@)
de: MTU '%@' ist ungültig.
es: El MTU '%@' no es válido.

source: macAlertUnrecognizedInterfaceKey (%@)
de: Schnittstelle enthält nicht erkannten Schlüssel '%@'
es: La interfaz contiene una clave no reconocida '%@'

source: macAlertInfoUnrecognizedInterfaceKey
de: Gültige Schlüssel sind: 'PrivateKey', 'ListenPort', 'Address', 'DNS' und 'MTU'.
es: Las claves válidas son: 'PrivateKey', 'ListenPort', 'Address', 'DNS' y 'MTU'.

source: macAlertPublicKeyInvalid
de: Öffentlicher Schlüssel ist ungültig
es: La clave pública no es válida

source: macAlertPreSharedKeyInvalid
de: Vorgeschalteter Schlüssel ist ungültig
es: La clave precompartida no es válida

source: macAlertAllowedIPInvalid (%@)
de: Erlaubte IP '%@' ist ungültig
es: La IP permitida '%@' no es válida

source: macAlertEndpointInvalid (%@)
de: Endpunkt '%@' ist ungültig
es: El punto de conexión '%@' no es válido

source: macAlertPersistentKeepliveInvalid (%@)
de: Wert für persistentes Keepalive '%@' ist ungültig
es: El valor de keepalive persistente '%@' no es válido

source: macAlertUnrecognizedPeerKey (%@)
de: Peer enthält nicht erkannten Schlüssel '%@'
es: El peer contiene una clave no reconocida '%@'

source: macAlertInfoUnrecognizedPeerKey
de: Gültige Schlüssel sind: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' und 'PersistentKeepalive'
es: Las claves válidas son: 'PublicKey', 'PresharedKey', 'AllowedIPs', 'Endpoint' y 'PersistentKeepalive'

source: macAlertMultipleEntriesForKey (%@)
de: Es sollte nur einen Eintrag pro Abschnitt für den Schlüssel '%@' geben
es: Debe haber solo una entrada por sección para la clave '%@'
